{
  "name": "McAfee ePolicy Orchestrator Authenticated XXE Credentials Exposure",
  "fullname": "auxiliary/gather/mcafee_epo_xxe",
  "rank": 300,
  "disclosure_date": "2015-01-06",
  "type": "auxiliary",
  "author": [
    "Brandon Perry <bperry.volatile@gmail.com>"
  ],
  "description": "This module will exploit an authenticated XXE vulnerability to read the keystore.properties\n      off of the filesystem. This properties file contains an encrypted password that is set during\n      installation. What is interesting about this password is that it is set as the same password\n      as the database 'sa' user and of the admin user created during installation. This password\n      is encrypted with a static key, and is encrypted using a weak cipher (ECB). By default,\n      if installed with a local SQL Server instance, the SQL Server is listening on all interfaces.\n\n      Recovering this password allows an attacker to potentially authenticate as the 'sa' SQL Server\n      user in order to achieve remote command execution with permissions of the database process. If\n      the administrator has not changed the password for the initially created account since installation,\n      the attacker will have the password for this account. By default, 'admin' is recommended.\n\n      Any user account can be used to exploit this, all that is needed is a valid credential.\n\n      The most data that can be successfully retrieved is 255 characters due to length restrictions\n      on the field used to perform the XXE attack.",
  "references": [
    "CVE-2015-0921",
    "CVE-2015-0922",
    "URL-https://seclists.org/fulldisclosure/2015/Jan/8"
  ],
  "rport": 8443,
  "autofilter_ports": [
    80,
    8080,
    443,
    8000,
    8888,
    8880,
    8008,
    3000,
    8443
  ],
  "autofilter_services": [
    "http",
    "https"
  ],
  "mod_time": "2020-10-02 17:38:06 +0000",
  "path": "/modules/auxiliary/gather/mcafee_epo_xxe.rb",
  "is_install_path": true,
  "ref_name": "gather/mcafee_epo_xxe",
  "post_auth": true,
  "needs_cleanup": false
}
