{
  "name": "Apache Tomcat AJP File Read",
  "fullname": "auxiliary/admin/http/tomcat_ghostcat",
  "rank": 300,
  "disclosure_date": "2020-02-20",
  "type": "auxiliary",
  "author": [
    "A Security Researcher of Chaitin Tech",
    "SunCSR Team"
  ],
  "description": "When using the Apache JServ Protocol (AJP), care must be taken when trusting incoming connections to Apache\n          Tomcat. Tomcat treats AJP connections as having higher trust than, for example, a similar HTTP connection.\n          If such connections are available to an attacker, they can be exploited in ways that may be surprising.\n\n          In Apache Tomcat 9.0.0.M1 to 9.0.0.30, 8.5.0 to 8.5.50 and 7.0.0 to 7.0.99, Tomcat shipped with an AJP\n          Connector enabled by default that listened on all configured IP addresses. It was expected (and recommended\n          in the security guide) that this Connector would be disabled if not required. This vulnerability report\n          identified a mechanism that allowed: - returning arbitrary files from anywhere in the web application -\n          processing any file in the web application as a JSP. Further, if the web application allowed file upload\n          and stored those files within the web application (or the attacker was able to control the content of the\n          web application by some other means) then this, along with the ability to process a file as a JSP, made\n          remote code execution possible.\n\n          It is important to note that mitigation is only required if an AJP port is accessible to untrusted users.\n          Users wishing to take a defence-in-depth approach and block the vector that permits returning arbitrary files\n          and execution as JSP may upgrade to Apache Tomcat 9.0.31, 8.5.51 or 7.0.100 or later. A number of changes were\n          made to the default AJP Connector configuration in 9.0.31 to harden the default configuration.\n          It is likely that users upgrading to 9.0.31, 8.5.51 or 7.0.100 or later will need to make small changes\n          to their configurations.",
  "references": [
    "CVE-2020-1938",
    "EDB-48143",
    "URL-https://www.chaitin.cn/en/ghostcat"
  ],
  "rport": 8080,
  "mod_time": "2022-10-01 17:54:59 +0000",
  "path": "/modules/auxiliary/admin/http/tomcat_ghostcat.rb",
  "is_install_path": true,
  "ref_name": "admin/http/tomcat_ghostcat",
  "check": true,
  "notes": {
    "AKA": [
      "Ghostcat"
    ],
    "Stability": [
      "crash-safe"
    ]
  },
  "needs_cleanup": false
}
